In [26]:
import os

import mysql.connector
from dotenv import load_dotenv
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from Sql_functions import read_query

In [27]:
query = 'select *from customers;'
read_query(query)

,CustomerID,FirstName,LastName,Email,Phone,Address,State
0,C-2023-100-1,Mahika,Sunder,MahikaSunder_11@zmail.com,03412176590,"H.No. 155, Chana",Assam
1,C-2023-100-10,Zeeshan,Vasa,ZeeshanVasa_1@zmail.com,+911151051656,"52, Roy Nagar",Tripura
2,C-2023-100-100,Aaina,Sachdeva,AainaSachdeva_9@zmail.com,+918834507719,"75/92, Kade Marg",Nagaland
3,C-2023-100-101,Shray,Bajwa,ShrayBajwa_11@zmail.com,07410498662,"45, Bora Ganj",Manipur
4,C-2023-100-102,Navya,Dash,NavyaDash_5@zmail.com,+917644200850,70/782\nBahl Road,Kerala
...,...,...,...,...,...,...,...
195,C-2023-100-95,Taran,Din,TaranDin_12@zmail.com,6834976149,H.No. 18\nArora Marg,Karnataka
196,C-2023-100-96,Bhamini,Gara,BhaminiGara_1@zmail.com,+913844979166,H.No. 22\nBrahmbhatt Zila,Chhattisgarh
197,C-2023-100-97,Hunar,Kothari,HunarKothari_13@zmail.com,+910694175434,"84, Madan Chowk",Kerala
198,C-2023-100-98,Riaan,Wali,RiaanWali_11@zmail.com,6570105054,98\nComar Zila,Telangana
199,C-2023-100-99,Navya,Chana,NavyaChana_4@zmail.com,00686138096,58/50\nDasgupta Road,Tamil Nadu

In [15]:
load_dotenv()

user = os.getenv('USER')
password = os. getenv('PASSWORD')
host = os.getenv('HOST')
database= 'swiftmarket'

In [16]:
connection = mysql.connector.connect(user=user,
                                     password=password,
                                     host=host,
                                     database=database)

cursor = connection.cursor()

In [17]:
connection.is_connected()

True

In [18]:
query = '''show tables'''
cursor.execute(query)
rows = cursor.fetchall()
for row in rows:
    print(row)

('categories',)
('customers',)
('employees',)
('salesdata',)
('subcategories',)
('suppliers',)

In [19]:
# Dimension tables: all tables contianing primary keys abd connected to fact tables
# Fact tables :e.g sales data


query = '''select * from salesdata limit 5;'''
cursor.execute(query)
rows = cursor.fetchall()
for row in rows:
    print(row)

(23000, 'C-2023-100-12', 6002, 1100, datetime.date(2023, 5, 2), 2, Decimal('176432.00'))
(23001, 'C-2023-100-141', 6029, 1115, datetime.date(2023, 12, 26), 2, Decimal('47172.00'))
(23002, 'C-2023-100-86', 6029, 1035, datetime.date(2023, 3, 26), 2, Decimal('47172.00'))
(23003, 'C-2023-100-72', 6006, 1016, datetime.date(2023, 8, 1), 2, Decimal('117644.00'))
(23004, 'C-2023-100-142', 6030, 1067, datetime.date(2023, 3, 6), 5, Decimal('336560.00'))

In [20]:
cursor.column_names

('SaleID',
 'CustomerID',
 'SubcatID',
 'EmployeeID',
 'SaleDate',
 'Quantity',
 'TotalPrice')

In [21]:
pd.DataFrame(data=rows, columns=cursor.column_names)

,SaleID,CustomerID,SubcatID,EmployeeID,SaleDate,Quantity,TotalPrice
0,23000,C-2023-100-12,6002,1100,2023-05-02,2,176432.00
1,23001,C-2023-100-141,6029,1115,2023-12-26,2,47172.00
2,23002,C-2023-100-86,6029,1035,2023-03-26,2,47172.00
3,23003,C-2023-100-72,6006,1016,2023-08-01,2,117644.00
4,23004,C-2023-100-142,6030,1067,2023-03-06,5,336560.00

In [22]:
def read_query(query):
   cursor.execute(query)
   rows = cursor.fetchall()
   return pd.DataFrame(data=rows, columns=cursor.column_names)

In [23]:
query = '''select * from customers limit 5;'''
read_query(query)

,CustomerID,FirstName,LastName,Email,Phone,Address,State
0,C-2023-100-1,Mahika,Sunder,MahikaSunder_11@zmail.com,03412176590,"H.No. 155, Chana",Assam
1,C-2023-100-10,Zeeshan,Vasa,ZeeshanVasa_1@zmail.com,+911151051656,"52, Roy Nagar",Tripura
2,C-2023-100-100,Aaina,Sachdeva,AainaSachdeva_9@zmail.com,+918834507719,"75/92, Kade Marg",Nagaland
3,C-2023-100-101,Shray,Bajwa,ShrayBajwa_11@zmail.com,07410498662,"45, Bora Ganj",Manipur
4,C-2023-100-102,Navya,Dash,NavyaDash_5@zmail.com,+917644200850,70/782\nBahl Road,Kerala

In [24]:
query = '''select s. saledate, c.firstname, s. totalprice
from salesdata s
join customers c
on s. customerid= c.customerid
order by s. saledate;'''
read_query(query)

         saledate firstname totalprice
0      2023-01-01    Miraan    8630.00
1      2023-01-01       Eva  159724.00
2      2023-01-01    Kashvi  139084.00
3      2023-01-01     Shalv  208626.00
4      2023-01-01      Heer   79387.00
...           ...       ...        ...
11996  2023-12-30      Azad  111075.00
11997  2023-12-30     Vidur   58785.00
11998  2023-12-30   Reyansh    9599.00
11999  2023-12-30     Sahil   99402.00
12000  2023-12-30   Inaaya   340156.00

[12001 rows x 3 columns]

In [29]:
query = 'show tables ;'
read_query(query)

  Tables_in_swiftmarket
0            categories
1             customers
2             employees
3             salesdata
4         subcategories
5             suppliers

JION TABLES

In [30]:
query = 'select * from salesdata limit 3;'
read_query(query)

,SaleID,CustomerID,SubcatID,EmployeeID,SaleDate,Quantity,TotalPrice
0,23000,C-2023-100-12,6002,1100,2023-05-02,2,176432.00
1,23001,C-2023-100-141,6029,1115,2023-12-26,2,47172.00
2,23002,C-2023-100-86,6029,1035,2023-03-26,2,47172.00

In [38]:
query = """select s. customerid, c. firstname, s. saledate, s. totalprice  
from salesdata s
join customers c
on s. customerid = c. customerid
limit 5;"""

read_query(query)

     customerid firstname    saledate totalprice
0  C-2023-100-1    Mahika  2023-07-22   67312.00
1  C-2023-100-1    Mahika  2023-05-23  176466.00
2  C-2023-100-1    Mahika  2023-11-26  190332.00
3  C-2023-100-1    Mahika  2023-03-31  205080.00
4  C-2023-100-1    Mahika  2023-11-22   14174.00

In [45]:
query = """
select t. customerid, c. firstname, t. expenditure
from
(select customerid,
sum(totalprice) as expenditure 
from salesdata
group by customerid) t 
join customers c
on t. customerid = c.customerid
order by t. expenditure desc
limit 20;"""

top_annual_customers = read_query(query)

In [46]:
top_annual_customers

        customerid firstname  expenditure
0    C-2023-100-13      Veer  13016064.00
1    C-2023-100-94  Priyansh  12629337.00
2    C-2023-100-57      Riya  12599608.00
3    C-2023-100-58     Vanya  12455437.00
4    C-2023-100-88     Dhruv  12280916.00
5   C-2023-100-165    Tarini  12130487.00
6   C-2023-100-197   Yuvraj   11868602.00
7   C-2023-100-199      Rhea  11704275.00
8   C-2023-100-196   Darshit  11520699.00
9    C-2023-100-75    Prerak  11442527.00
10    C-2023-100-3      Anay  11316944.00
11  C-2023-100-130     Amira  11220842.00
12   C-2023-100-99     Navya  11155014.00
13  C-2023-100-132    Mahika  11149404.00
14    C-2023-100-6    Ayesha  11077360.00
15   C-2023-100-77   Indrans  11038816.00
16   C-2023-100-91    Miraya  10995314.00
17  C-2023-100-167   Devansh  10781857.00
18   C-2023-100-53      Pihu  10773220.00
19   C-2023-100-56   Elakshi  10697643.00